In [3]:


import pandas as pd
import numpy as np

data = [10,20,30,40,50]

a=pd.Series(data)
a

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
b=np.array(data)
b

array([10, 20, 30, 40, 50])

In [5]:
a.values

array([10, 20, 30, 40, 50], dtype=int64)

In [6]:
a.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
a[2]

30

In [8]:
b[2]

30

In [15]:
a.name="örnek seri"
a.index.name="indeks"
a

indeks
0    10
1    20
2    30
3    40
4    50
Name: örnek seri, dtype: int64

In [17]:
indisler=["ali","veli","ayse"]
degerler=[100,150,200]
x=pd.Series(degerler, index=indisler)
x

ali      100
veli     150
ahmet    200
dtype: int64

In [86]:
x[["ali","veli"]]

ali     100
veli    150
dtype: int64

In [21]:
#seriler üzerinde aritmetik işlemler
5*(x+2)

ali       510
veli      760
ahmet    1010
dtype: int64

In [23]:
x

ali      100
veli     150
ahmet    200
dtype: int64

In [22]:
np.sqrt(x)

ali      10.000000
veli     12.247449
ahmet    14.142136
dtype: float64

In [24]:
#seriler üzerinde filtreleme

x[x>150]

ahmet    200
dtype: int64

In [44]:
ogrenciler={'isim':['ali','veli','ayse','fatma','mehmet','mustafa','zeynep'],
           'not':[54,78,65,40,90,76,85],
           'yas':[21,20,22,22,21,21,20]}
df=pd.DataFrame(ogrenciler)
df

      isim  not  yas
0      ali   54   21
1     veli   78   20
2     ayse   65   22
3    fatma   40   22
4   mehmet   90   21
5  mustafa   76   21
6   zeynep   85   20

In [46]:
df.head()

     isim  not  yas
0     ali   54   21
1    veli   78   20
2    ayse   65   22
3   fatma   40   22
4  mehmet   90   21

In [87]:
df['not']*1.5

0     81.0
1    117.0
2     97.5
3     60.0
4    135.0
5    114.0
6    127.5
Name: not, dtype: float64

In [88]:
df['yas'].sum()

147

In [90]:

df1= pd.DataFrame(ogrenciler, columns=['isim','not','giris tarihi'])
df1

      isim  not giris tarihi
0      ali   54          NaN
1     veli   78          NaN
2     ayse   65          NaN
3    fatma   40          NaN
4   mehmet   90          NaN
5  mustafa   76          NaN
6   zeynep   85          NaN

In [91]:

df1.dropna()

Empty DataFrame
Columns: [isim, not, giris tarihi]
Index: []

In [92]:

df1.iloc[0,2]=2021
df1.iloc[1,2]=2022

In [93]:
df1

      isim  not giris tarihi
0      ali   54         2021
1     veli   78         2022
2     ayse   65          NaN
3    fatma   40          NaN
4   mehmet   90          NaN
5  mustafa   76          NaN
6   zeynep   85          NaN

In [94]:

df1.dropna()

   isim  not giris tarihi
0   ali   54         2021
1  veli   78         2022

In [95]:

df1.isnull().sum()

isim            0
not             0
giris tarihi    5
dtype: int64

In [117]:
df1.T

                 0     1     2      3       4        5       6
isim           ali  veli  ayse  fatma  mehmet  mustafa  zeynep
not             54    78    65     40      90       76      85
giris tarihi  2021  2022   NaN    NaN     NaN      NaN     NaN

In [118]:

df1.describe()

          isim  not  giris tarihi
count        7    7             2
unique       7    7             2
top     zeynep   78          2022
freq         1    1             1

In [119]:

df1['giris tarihi'].fillna((int(df1['giris tarihi'].mean())), inplace=True)
df1

      isim not  giris tarihi
0      ali  54          2021
1     veli  78          2022
2     ayse  65          2021
3    fatma  40          2021
4   mehmet  90          2021
5  mustafa  76          2021
6   zeynep  85          2021

In [35]:

df1.T

                0     1     2
isim          ali  veli  ayse
not            54    78    65
giris tarihi  NaN   NaN   NaN

In [65]:

ogr={'isim':['ali','ahmet','mehmet','veli','arda','doruk'],
    'arasinav':[5,54,12,22,15,87],
    'odev':[68,44,87,74,68,70],
    'final':[55,64,77,88,100,90]}

df2=pd.DataFrame(ogr, columns=['isim','arasinav','odev','final','ortalama'])
df2['ortalama']=df2['arasinav']*0.25+df2['odev']*0.25+df2['final']*0.50

df2

     isim  arasinav  odev  final  ortalama
0     ali         5    68     55     45.75
1   ahmet        54    44     64     56.50
2  mehmet        12    87     77     63.25
3    veli        22    74     88     68.00
4    arda        15    68    100     70.75
5   doruk        87    70     90     84.25

In [66]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   isim      6 non-null      object
 1   arasinav  6 non-null      int64
 2   odev      6 non-null      int64
 3   final     6 non-null      int64
 4   ortalama  6 non-null      float64
dtypes: float64(1), int64(3), object(1)
memory usage: 368.0+ bytes

In [67]:

df2.isnull().sum()

isim        0
arasinav    0
odev        0
final       0
ortalama    0
dtype: int64

In [ ]:

#https://www.kaggle.com/datasets/pavantanniru/-datacleaningforbeginnerusingpandas?resource=download